; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v3 - type_3 ?v5 - type_1)
 	      (pred_4 ?v7 - object ?v5 - type_1)
	      (pred_1 ?v3 - type_3 ?v6 - type_2)
	      (pred_3 ?v3 - type_3 ?v7 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v3 - type_3 ?v2 ?v8 - type_1)
       :precondition (and  (pred_2 ?v3 ?v2))
       :effect (and  (pred_2 ?v3 ?v8)
		     (not (pred_2 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v1) (pred_2 ?v3 ?v1) (pred_1 ?v3 ?v6))
       :effect (and (pred_3 ?v3 ?v4 ?v6)
		    (not (pred_4 ?v4 ?v1)) 
		    (not (pred_1 ?v3 ?v6))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v4 ?v6) (pred_2 ?v3 ?v1))
       :effect (and (pred_4 ?v4 ?v1)
		    (pred_1 ?v3 ?v6)
		    (not (pred_3 ?v3 ?v4 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_08 - type_3
obj_07 obj_12 obj_11 obj_04 - type_2
obj_01 obj_10 obj_09 - type_1
obj_05 obj_06 obj_03 - object)
(:init
(pred_2 obj_02 obj_10)
(pred_1 obj_02 obj_07)
(pred_1 obj_02 obj_12)
(pred_2 obj_08 obj_01)
(pred_1 obj_08 obj_11)
(pred_1 obj_08 obj_04)
(pred_4 obj_05 obj_09)
(pred_4 obj_06 obj_10)
(pred_4 obj_03 obj_09)
)
(:goal
(and
(pred_4 obj_05 obj_10)
(pred_4 obj_06 obj_10)
(pred_4 obj_03 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_09)))
)
)

; plan
1. (op_1 obj_08 obj_01 obj_09)
   deleted: (pred_2 obj_08 obj_01)
   added: (pred_2 obj_08 obj_09)
   goals met: 2 of 3
2. (op_3 obj_08 obj_05 obj_09 obj_04)
   deleted: (pred_4 obj_05 obj_09) (pred_1 obj_08 obj_04)
   added: (pred_3 obj_08 obj_05 obj_04)
   goals met: 2 of 3
3. (op_1 obj_08 obj_09 obj_10)
   deleted: (pred_2 obj_08 obj_09)
   added: (pred_2 obj_08 obj_10)
   goals met: 2 of 3
4. (op_2 obj_08 obj_05 obj_10 obj_04)
   deleted: (pred_3 obj_08 obj_05 obj_04)
   added: (pred_4 obj_05 obj_10) (pred_1 obj_08 obj_04)
   goals met: 3 of 3
